Title: Common Table Expressions
Slug: sql/common-table-expressions
Category: SQL
Tags: WITH, SELECT, FROM, LIMIT, OVER, PARTITION BY, ORDER BY, DESC, rank
Date: 2017-08-16
Modified: 2017-08-16

#### Load ipython-sql extension

In [1]:
# The 2 lines below prevent an error message from being displayed when we run %load_ext sql
import warnings
warnings.filterwarnings('ignore')

%load_ext sql
%config SqlMagic.feedback = False

#### Connect to the database

In [2]:
%%sql

postgresql://localhost/dvdrental

'Connected: None@dvdrental'

#### Using the `WITH` clause
We use the `WITH` keyword to create temporary tables just for the query we're currently working on. These are called Common Table Expressions (CTEs).

In the simple example below, we execute the query in the `WITH` clause and then return all rows from it.

In [3]:
%%sql

WITH rental_cte AS (
    SELECT
        r.rental_id
        , customer_id
        , r.return_date
    FROM
        rental r
    LIMIT
        10
)

SELECT
    *
FROM
    rental_cte rc

[(2, 459, datetime.datetime(2005, 5, 28, 19, 40, 33)),
 (3, 408, datetime.datetime(2005, 6, 1, 22, 12, 39)),
 (4, 333, datetime.datetime(2005, 6, 3, 1, 43, 41)),
 (5, 222, datetime.datetime(2005, 6, 2, 4, 33, 21)),
 (6, 549, datetime.datetime(2005, 5, 27, 1, 32, 7)),
 (7, 269, datetime.datetime(2005, 5, 29, 20, 34, 53)),
 (8, 239, datetime.datetime(2005, 5, 27, 23, 33, 46)),
 (9, 126, datetime.datetime(2005, 5, 28, 0, 22, 40)),
 (10, 399, datetime.datetime(2005, 5, 31, 22, 44, 21)),
 (11, 142, datetime.datetime(2005, 6, 2, 20, 56, 2))]

#### A common use for CTEs â€” ranking your results
As explained in the page on [Window Functions](../sql/ranking-results-with-window-functions.html), CTEs are useful when ranking our results.

Here we will find the last 3 films returned by a sample of customers.

In [4]:
%%sql

WITH rental_cte AS (
    SELECT
        r.rental_id
        , customer_id
        , r.return_date
        , rank() OVER(PARTITION BY r.customer_id ORDER BY r.return_date DESC) as rk
    FROM
        rental r
)

SELECT
    *
FROM
    rental_cte rc
WHERE
    rc.rk < 4
-- Show only the first 3 customers to save space
LIMIT
    9

[(15315, 1, datetime.datetime(2005, 8, 30, 1, 51, 46), 1),
 (15298, 1, datetime.datetime(2005, 8, 28, 22, 49, 37), 2),
 (14825, 1, datetime.datetime(2005, 8, 27, 7, 1, 57), 3),
 (15145, 2, datetime.datetime(2005, 8, 31, 15, 51, 4), 1),
 (14743, 2, datetime.datetime(2005, 8, 29, 0, 18, 56), 2),
 (14475, 2, datetime.datetime(2005, 8, 27, 8, 59, 32), 3),
 (14699, 3, datetime.datetime(2005, 8, 29, 18, 8, 48), 1),
 (13403, 3, datetime.datetime(2005, 8, 27, 19, 23, 7), 2),
 (15619, 3, datetime.datetime(2005, 8, 26, 7, 21, 14), 3)]